<?php include './header.php'; ?>
<div class="jumbotron text-center">
    <h1 class="display-4"><b>Basic Coding</b></h1>
    <p class="lead">30200-0014 หลักการเขียนโปรแกรมเบื้องต้น</p>
</div>

<div class="container">
    <div class="row">
        <div class="col-md-4">
            <h3 class="text-center mb-4">จุดประสงค์รายวิชา</h3>
            <ol>
                <li>เข้าใจคำสั่ง โครงสร้างและหลักไวยากรณ์ของภาษา</li>
                <li>วิเคราะห์การแก้ปัญหาเชิงขั้นตอนวิธีและออกแบบโปรแกรมอย่างง่าย</li>
                <li>สามารถสังเคราะห์คำสั่งในโปรแกรมภาษา ให้ออกมาเป็นโปรแกรมที่ต้องการอย่างมีผล</li>
                <li>สามารถเขียนโปรแกรมจัดการแฟ้มข้อมูล</li>
                <li>มีกิจนิสัยและส่งเสริมคุณธรรม จริยธรรม ค่านิยมที่ดี ในการใช้คอมพิวเตอร์</li>
            </ol>
        </div>
        <div class="col-md-4">
            <h3 class="text-center mb-4">อธิบายรายวิชา</h3>
            <ol>
                <li>วิเคราะห์การแก้ปัญหาเชิงขั้นตอนวิธีด้วยคอมพิวเตอร์</li>
                <li>ทำการสังเคราะห์เครื่องมือและคำสั่งในภาษาโปรแกรมให้เป็นภาษาที่ใช้งานได้ตามต้องการ</li>
                <li>เขียนโปรแกรมจัดการแฟ้มข้อมูล</li>
            </ol>
        </div>
        <div class="col-md-4">
            <h3 class="text-center mb-4">มาตรฐานรายวิชา</h3>
            ให้เลือกเรียนโปรแกรมภาษาแบบ GUI ตามความต้องการ โดยครอบคลุมสาระสำคัญต่อไปนี้

            ศึกษาและปฏิบัติเกี่ยวกับการวิเคราะห์ขั้นตอนวิธีในการแก้ไขปัญหา การออกแบบส่วนแสดงผลและติดต่อกับผู้ใช้ การใช้เครื่องมือในโปรแกรม โครงสร้างและไวยาการณ์ของการเขียนคำสั่ง การสังเคราะห์เครื่องมือและสั่งให้เป็นโปรมแกรมที่ต้องการ การสร้างโปรแกรมจัดกราแฟ้มข้อมูล
        </div>

    </div>
</div>
<?php include './footer.php'; ?>